{"sections":{"main":{"type":"main-product","blocks":{"price":{"type":"price","settings":{}},"separator":{"type":"separator","settings":{}},"variant_picker":{"type":"variant_picker","settings":{"variant_labels":true,"picker_type":"dropdown","product_dynamic_variants_enable":true,"color_swatches":false}},"e7ccde62-4dcb-415a-b80e-db2f2770b0dd":{"type":"quantity_selector","disabled":true,"settings":{}},"f6fa3aa0-afd3-4636-9c27-b1c4b7b16751":{"type":"shopify:\/\/apps\/infinite-options\/blocks\/app-block\/7e73b6f9-82b0-45f5-9b9b-04f446ba1a9b","settings":{}},"a0134c8d-8f3d-4fe6-b099-2ba2ee7d019c":{"type":"shopify:\/\/apps\/uploadery\/blocks\/app-block\/5253cb5d-9d0f-47bd-a1aa-51cb83bf6de3","settings":{}},"buy_buttons":{"type":"buy_buttons","settings":{"show_dynamic_checkout":false,"surface_pickup_enable":false}},"5bdf7bf6-1e13-4c5c-8fef-ff6d7e3a3140":{"type":"payment_icons","settings":{}}},"block_order":["price","separator","variant_picker","e7ccde62-4dcb-415a-b80e-db2f2770b0dd","f6fa3aa0-afd3-4636-9c27-b1c4b7b16751","a0134c8d-8f3d-4fe6-b099-2ba2ee7d019c","buy_buttons","5bdf7bf6-1e13-4c5c-8fef-ff6d7e3a3140"],"settings":{"sku_enable":false,"image_position":"left","image_size":"small","product_zoom_enable":true,"thumbnail_position":"below","thumbnail_arrows":true,"mobile_layout":"partial","enable_video_looping":true,"product_video_style":"muted"}},"sub":{"type":"product-full-width","blocks":{"99088804-1ba2-4337-ba66-667f19ecc90b":{"type":"description","settings":{"is_tab":true,"title":"Description"}},"7f9dc493-f6bf-4537-b3a1-627f7b887321":{"type":"tab","disabled":true,"settings":{"title":"Purchasing Instructions","content":"<h3>Step 1: Pick a technology<\/h3><p>Enhance your vehicle with these high-performance films, offering powerful heat insulation, IR rejection, and UV protection. Whether you prefer the sleek, dark aesthetics of carbon or the advanced performance of ceramic, our pre-cut patterns ensure a seamless installation experience, giving your windows a stylish look while keeping you stylish and protected.<\/p><h4>Carbon<\/h4><p>Experience the perfect blend of style and performance with our carbon film, offering a sleek, stylish finish and excellent solar protection.<\/p><h4>Ceramic<\/h4><p>Experience impressive heat insulation, solar protection, and style with our ceramic window film. Offering a great balance between performance and affordability, it ensures optimal comfort and a sleek appearance for your vehicle.<\/p><h4>Premium Ceramic<\/h4><p>For those seeking the ultimate in heat insulation, solar protection, and style, our premium ceramic window film provides the highest performance while preserving a sleek and stylish appearance; it's the perfect choice for those who demand the best in window film technology.<\/p><h3>Step 2: Enter your vehicle details<\/h3><p>To purchase the perfect pre-cut window film pattern for your vehicle, simply provide us with your vehicle details. Enter your make, model, year, and VIN to ensure a precise fit for a seamless installation. Our tailored patterns will guarantee a hassle-free and professional result, giving your vehicle the performance and style it deserves.<\/p><h3>Step 3: Choose your shade<\/h3><p>Choosing the right shade of window tint for your vehicle is an important decision, balancing style with performance. Consider your local regulations before purchasing. Additionally, think about your preferences for privacy, heat insulation, solar protection, and visibility. Lighter shades provide a more subtle look with less performance, while darker shades offer enhanced privacy and higher performance.<\/p><h3>Step 4: Proceed to checkout<\/h3><p>We're excited to help you transform your vehicle. When you've completed the above steps, head to checkout to finalize your purchase. Our secure payment process ensures a seamless transaction, and our team is ready to assist you if you have any questions or need further assistance. Pre-cut patterns typically ship out within  48 business hours.<\/p><h3>Step 5: Install your pattern<\/h3><p>Installing a pre-cut window film pattern is a straightforward process that can be done with ease. Thoroughly clean your windows, align the pattern accurately, and apply the film using a solution and squeegee, ensuring any air bubbles are smoothed out. If the window is curved, you will need a heat gun to shrink the film to the glass.<\/p><p><a href=\"https:\/\/flexfilmstore.com\/pages\/flexfilm-video-library\" target=\"_blank\" title=\"https:\/\/flexfilmstore.com\/pages\/flexfilm-video-library\">View Resources<\/a><\/p><h3>Step 6: Caring For Your Window Film<\/h3><p>Proper care and maintenance will prolong the lifespan and appearance of your window film. To keep it in optimal condition, avoid cleaning the film for at least 30 days after installation. When cleaning, use a non-abrasive, ammonia-free cleaner and a soft, lint-free cloth or sponge. By following these guidelines, you can ensure that your window film stays looking great for years to come.<\/p>","page":""}},"69a0ad4f-d66e-42d6-a53a-e1e91b3ac1a3":{"type":"tab","settings":{"title":"Benefits","content":"<p>Paint protection film (PPF), also known as clear bra or clear film, is a transparent, polyurethane film that is applied to the exterior of a vehicle to protect the paint from damage. Here are some of the benefits of using our paint protection film (PPF):<\/p><ul><li><strong>Save an arm and a leg:<\/strong> while professional PPF installation can be costly, using pre-cut patterns allows you to achieve protection for your vehicle's paint at a fraction of the price. You'll save on labor costs by doing it yourself.<\/li><li><strong>Shield from rock attacks:<\/strong> you know those annoying little rocks and road junk that seem to have a vendetta against your vehicle's paint? Our paint protection film is like your vehicle's personal bodyguard, deflecting those little hooligans away and preventing nasty chips and scratches.<\/li><li><strong>Scratch-resistant protection: <\/strong>our PPF is like your vehicle's invisible shield against scratches and swirl marks. Even if you accidentally brush up against a prickly bush, the film's got your back.<\/li><li><strong>Sunscreen for your vehicle:<\/strong> just like how you slather on sunscreen to prevent sunburn, Our PPF gives your vehicle some UV protection. It stops the sun from turning your paint into a faded mess.<\/li><li><strong>Chemical-proof defense:<\/strong> bird droppings, bug splatters, and tree sap are like kryptonite for your vehicle's paint. But with our PPF, it's like your vehicle's wearing a Hazmat suit -chemicals can't touch it.<\/li><li><strong>Self-healing superpower:<\/strong> our PPF can even heal minor scratches and scrapes. It's like magic! The film reacts to heat (sunlight or warm water), and those annoying marks disappear.<\/li><li><strong>Rescue your resale value:<\/strong> our PPF is your vehicle's secret to looking young and desirable. When it's time to sell, a well-protected paint job can fetch you more bucks.<\/li><li><strong>Low-maintenance buddy:<\/strong> cleaning our PPF is a breeze. You don't need any fancy products or treatments. Just wash your vehicle like you always do, and it stays happy.<\/li><li><strong>Fits like a glove:<\/strong> our PPF is custom-cut for your vehicle. It's like having a tailored suit for your vehicle, and when it's done right, you can't even tell it's there.<\/li><li><strong>Lasts longer than your average Netflix series:<\/strong> our high-quality PPF sticks around for years and years, so you're making a long-term investment in your vehicle's beauty.<\/li><li><strong>Striking, stylish look:<\/strong> our PPF gives your vehicle a glossy, high-end finish. It's like putting on a tuxedo for a night out.<\/li><li><strong>Not just for the front: <\/strong>you can install PPF on more than just the front end. Side mirrors, door cups, and other vulnerable spots can get in on the action.<\/li><li><strong>No commitment issues:<\/strong> if you change your mind or want a fresh look for your car, no worries! PPF can be removed without leaving a trace.<\/li><\/ul>","page":""}},"0d6a0d26-bd81-4293-816a-5835d48d902f":{"type":"tab","settings":{"title":"Maintenance & Care","content":"<p>To ensure the longevity of your PPF pattern, please adhere to the instructions below. Failure to adhere to the maintenance and care instructions can void the product's warranty.<\/p><ul><li>Every 3-4 months, use a non-abrasive wax or sealant application to ensure longevity to product.<\/li><li>Do not use abrasive drying materials during drying or waxing.<\/li><li>Do not wax or wash vehicle for 7 days after installation.<\/li><li>Prevent staining by removing all bugs, sap, tar and other substances as soon as possible.<\/li><li>Do not use polishing compounds, clay bars or waxes that contain dyes or abrasives.<\/li><li>Do not use abrasive sponges or wash mitts during washing.<\/li><li>Avoid using a high pressure sprayer too close to the vehicle.<\/li><li>Do not use solvent based bug and tar removers.<\/li><\/ul>","page":""}},"fd5a6732-58c3-4cef-afe4-c605840fd596":{"type":"tab","settings":{"title":"Installation Steps","content":"<h2>Tools and Stuff You'll Need:<\/h2><ul><li>A PPF pre-cut pattern made for your vehicle model.<\/li><li>Rubbing alcohol or PPF surface cleaner.<\/li><li>Some soft, lint-free towels.<\/li><li>A squeegee or an applicator tool.<\/li><li>A fresh utility knife blade.<\/li><li>If you've got one, a heat gun or a hairdryer.<\/li><li>A bit of baby shampoo or mild soap.<\/li><li>Painter's tape.<\/li><li>And, of course, a nice, clean workspace.<\/li><li>You can purchase basic installation tools from us by <a href=\"\/collections\/ppf-starter-tools\" title=\"PPF Starter Tools\">clicking here<\/a>.<\/li><\/ul><h2>Getting Down to Business:<\/h2><h3>1. Prep Your Workspace:<\/h3><ul><li>Find a clean, garage-like spot to do this; keep it away from crazy heat or cold.<\/li><\/ul><h3>2. Get Your Car Super Clean:<\/h3><ul><li>Wash the area where you're going to slap on the PPF until it's sparkling. Get rid of dirt, dust, and any gunk.<\/li><li>Use rubbing alcohol or PPF surface cleaner to make sure it's squeaky clean.<\/li><\/ul><h3>3. Line Up the PPF:<\/h3><ul><li>Lay out the pre-cut PPF on your car's surface without peeling off the backing.<\/li><li>Stick it in place with some painter's tape, making sure it's centered and all that jazz.<\/li><\/ul><h3>4. Make Things Wet:<\/h3><ul><li>Mix water with a few drops of baby shampoo or mild soap. This is your soapy solution.<\/li><li>Spray this soapy mix on both your car's surface and the sticky side of the PPF. It helps you move things around a bit.<\/li><\/ul><h3>5. Apply the PPF:<\/h3><ul><li>Slowly peel off the backing from the PPF, revealing the sticky part.<\/li><li>Gently lay the PPF down on your car's surface, aligning it perfectly with the curves and edges.<\/li><li>As you go, use your squeegee to push out any air bubbles and extra water from under the film.<\/li><li>Start from the middle and work your way out, keeping it smooth.<\/li><\/ul><h3>6. Trim the Extra Bits:<\/h3><ul><li>If there's any excess PPF hanging around, use your utility knife to trim it off. Go slow, don't cut your car!<\/li><\/ul><h3>7. Warm It Up (Optional):<\/h3><ul><li>If the PPF needs to hug tight curves, a heat gun or hairdryer can help. Warm the film a bit, so it's more flexible and fits snug.<\/li><\/ul><h3>8. Give It a Once-Over:<\/h3><ul><li>After you've applied the PPF, use the squeegee again to make sure there are no sneaky air bubbles or weird spots.<\/li><\/ul><h3>9. Let It Chill:<\/h3><ul><li>The PPF needs to dry and cure, usually for a day or two. Check the instructions that came with your kit.<\/li><\/ul>","page":""}},"938c8a19-0ef1-410a-9df2-b7f545fa21b9":{"type":"tab","settings":{"title":"Return & Refund Policy","content":"<p>Please be aware that we are unable to accept returns or provide refunds for pre-cut patterns of window film or paint protection film as each order is tailored to suit the individual specifications of our customers' vehicles.<br\/><br\/>Before making a purchase, it is essential that buyers take the initiative to acquaint themselves with the local regulations regarding window film usage as well as the proper installation methods.<\/p><p>Flexfilm holds no liability for any direct, indirect, or incidental damages resulting from the appropriate or inappropriate application of our products. We do not offer refunds for pre-cut patterns based on buyer's remorse or suboptimal outcomes, particularly for non-professionals lacking the requisite licenses or certifications.<\/p><p>By purchasing a pre-cut pattern from Flexfilm, you expressly consent to adhere to our established return and refund policy.<\/p>","page":""}}},"block_order":["99088804-1ba2-4337-ba66-667f19ecc90b","7f9dc493-f6bf-4537-b3a1-627f7b887321","69a0ad4f-d66e-42d6-a53a-e1e91b3ac1a3","0d6a0d26-bd81-4293-816a-5835d48d902f","fd5a6732-58c3-4cef-afe4-c605840fd596","938c8a19-0ef1-410a-9df2-b7f545fa21b9"],"settings":{"max_width":true}},"a31f60f1-286c-44bf-a469-9a75eb30989f":{"type":"rich-text","blocks":{"template--14820000137303__a31f60f1-286c-44bf-a469-9a75eb30989f-1686254916e228d4c5-0":{"type":"heading","settings":{"title":"Where To Start"}},"template--14820000137303__a31f60f1-286c-44bf-a469-9a75eb30989f-1686254916e228d4c5-1":{"type":"text","settings":{"enlarge_text":false,"text":"<p>Our pre-cut paint protection film patterns are the DIY car lover's dream! Say goodbye to the hassle of measuring and cutting because these patterns are custom-made for your ride. Keep your paint looking fresh and fend off those pesky rock chips and scratches with ease. Get that pro look without the sweat and cost – it's vehicle protection made simple!<\/p>"}}},"block_order":["template--14820000137303__a31f60f1-286c-44bf-a469-9a75eb30989f-1686254916e228d4c5-0","template--14820000137303__a31f60f1-286c-44bf-a469-9a75eb30989f-1686254916e228d4c5-1"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"f1ad9859-205b-435b-8c8d-e43835d8fcc9":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/ppf_application3.jpg","image_width":500,"subtitle":"Step 1","title":"Pick An Application","text":"<p>We've made it easy for you to select the precise areas of your vehicle that need protection. Just pick your preferred protection zones during the ordering process, and our precision-cut patterns will be tailored to your exact specifications.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","layout":"left","divider":false}},"434327da-5d58-4102-9e77-e64dbccb854b":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/ppf_vehicle.jpg","image_width":500,"subtitle":"Step 2","title":"Enter Your Vehicle Details","text":"<p>To purchase the perfect pre-cut PPF pattern for your vehicle, simply provide us with your vehicle details. Enter your make, model, year, and VIN to ensure a precise fit for a seamless installation. Our tailored patterns will guarantee a hassle-free and professional result, giving your vehicle the protection and style it deserves.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","layout":"right","divider":false}},"45be59c6-6217-4b55-b85f-30cbc7ae8470":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/ppf_photo.jpg","image_width":500,"subtitle":"Step 3","title":"Upload a photo","text":"<p>For a perfect fit and hassle-free installation, we kindly request that you upload a photo of your vehicle when purchasing our pre-cut paint protection film patterns. Your photo ensures precision by customizing the pattern to your specific make and model, leaving no room for guesswork during installation.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","layout":"left","divider":false}},"bc6ad260-ae03-4b7b-a4d2-4db26ba64d33":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/ppf-pattern.jpg","image_width":500,"subtitle":"Step 4","title":"Head To Checkout","text":"<p>We're excited to help you transform your vehicle. When you've completed the above steps, head to checkout to finalize your purchase. Our secure payment process ensures a seamless transaction, and our team is ready to assist you if you have any questions or need further assistance. Pre-cut patterns typically ship out within  48 business hours.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","layout":"right","divider":false}},"417b8986-dd91-44c6-9c9c-f1db262467d5":{"type":"text-and-image","settings":{"image":"shopify:\/\/shop_images\/ppf_installation2.jpg","image_width":500,"subtitle":"Step 5","title":"Install Your Pattern","text":"<p>Transform your DIY project into a professional-grade endeavor with our precision-cut paint protection film patterns. Designed for your vehicle's exact make and model, the installation is hassle-free. Get top-notch protection against rock chips, scratches, and UV damage without the need for costly professional installation.<\/p>","button_label":"","button_link":"","button_style":"primary","align_text":"left","layout":"left","divider":false}},"product-recommendations":{"type":"product-recommendations","disabled":true,"settings":{"show_product_recommendations":true,"product_recommendations_heading":"You may also like","related_count":5}},"1cebed19-7212-4765-b4b0-7bc04d073289":{"type":"featured-collection","settings":{"title":"PPF Installation Tools","home_featured_products":"ppf-starter-tools","per_row":5,"rows":2,"mobile_scrollable":true,"view_all":true,"divider":false}},"testimonials":{"type":"testimonials","blocks":{"testimonials-0":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"I love Flexfilm. The customer service and products are amazing. I love that I can find almost any tool I need, in one place. Thanks Ralph and team.\"<\/p>","image":"shopify:\/\/shop_images\/tint-factor.jpg","author":"Alexis Steele","author_info":"Tint Factor, LLC"}},"testimonials-1":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"As an installer I think it is a very high quality product and from my customers stand point they are extremely happy.\"<\/p>","image":"shopify:\/\/shop_images\/prestige-window-tinting.jpg","author":"Craig Haney","author_info":"Prestige Window Tinting"}},"testimonials-2":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"Flexfilm is the best hands down for the prices and service. You can't find anything better out there...\"<\/p>","image":"shopify:\/\/shop_images\/kandy-wrapz.jpg","author":"Sean Wahlberg","author_info":"Kandy Wrapz"}},"6a709fdb-7d09-4350-be01-b93824d8a361":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"Been using it for 2+ years and I love it shrinks like a dream and I have never had a problem with it at all.\"<\/p>","image":"shopify:\/\/shop_images\/tint-plug.jpg","author":"Bradley Jones","author_info":"The Tint Plug"}},"f73b4a71-d3c8-40a9-a0c4-d33c00b2cef3":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"This company is great to work with, and the tint works amazing!\" <\/p>","image":"shopify:\/\/shop_images\/rab-kustomz.jpg","author":"Preston Raber","author_info":"RAB Kustoms"}},"babf7bd6-f43d-492c-9c94-966bf46cdef3":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"I have been using your film for almost 7 years now and never had a problem.\" <\/p>","image":"shopify:\/\/shop_images\/zane-wilson.jpg","author":"Zane Wilson","author_info":""}},"0ea6fe32-e255-48e2-bf87-b554c815a6ed":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"Works great! Definitely a go to for me. As a newbie I have enjoyed how easy it is to work with.\"<\/p>","image":"shopify:\/\/shop_images\/ryan-mclane.jpg","author":"Ryan Mclane","author_info":""}},"5b41638d-9d08-4bc5-b8ad-ef417a67d7d8":{"type":"testimonial","settings":{"icon":"5-stars","testimonial":"<p>\"I've used most of the industry leaders. I'm with Flexfilm now\"<\/p>","image":"shopify:\/\/shop_images\/terrance-garnto.jpg","author":"Terrance Garnto","author_info":""}}},"block_order":["testimonials-0","testimonials-1","testimonials-2","6a709fdb-7d09-4350-be01-b93824d8a361","f73b4a71-d3c8-40a9-a0c4-d33c00b2cef3","babf7bd6-f43d-492c-9c94-966bf46cdef3","0ea6fe32-e255-48e2-bf87-b554c815a6ed","5b41638d-9d08-4bc5-b8ad-ef417a67d7d8"],"settings":{"title":"What Our Customers Say","align_text":"center","round_images":true,"color_background":"#f4f4f4","color_text":"#1c1d1d"}},"9c7cd641-b130-443e-aaaf-3d8f9a9867a1":{"type":"advanced-content","blocks":{"template--14820000137303__9c7cd641-b130-443e-aaaf-3d8f9a9867a1-168739287191ece0ce-1":{"type":"liquid","settings":{"code":"<center><h2>What Our Customers Are Saying<\/h2><video height=\"720\" controls>\n  <source src=\"https:\/\/cdn.shopify.com\/videos\/c\/o\/v\/f5c409b31e2f4a449927856d8a1826a2.mp4\" type=\"video\/mp4\">\nYour browser does not support the video.\n<\/video><\/center>","width":"100%","alignment":"center"}}},"block_order":["template--14820000137303__9c7cd641-b130-443e-aaaf-3d8f9a9867a1-168739287191ece0ce-1"],"settings":{"full_width":false,"space_around":true}},"collection-return":{"type":"collection-return","settings":{}},"recently-viewed":{"type":"recently-viewed","disabled":true,"settings":{"recent_count":5}},"product-sections-template":{"type":"product-sections-template","disabled":true,"settings":{}}},"order":["main","sub","a31f60f1-286c-44bf-a469-9a75eb30989f","f1ad9859-205b-435b-8c8d-e43835d8fcc9","434327da-5d58-4102-9e77-e64dbccb854b","45be59c6-6217-4b55-b85f-30cbc7ae8470","bc6ad260-ae03-4b7b-a4d2-4db26ba64d33","417b8986-dd91-44c6-9c9c-f1db262467d5","product-recommendations","1cebed19-7212-4765-b4b0-7bc04d073289","testimonials","9c7cd641-b130-443e-aaaf-3d8f9a9867a1","collection-return","recently-viewed","product-sections-template"]}